create table 사원 (
	사원번호 int primary key,
	이름 varchar(20) not null,
	입사일 date not null,
	호봉 int not null default 10,
	휴대폰 varchar(13) unique
);

insert into 사원 values
(1101, '김정아','2022-03-01',20,'010-4122-1231'),
(1102, '김아','2022-03-01',21,'010-1152-1231'),
(1103, '김정','2022-03-01',24,'010-1162-1231'),
(1104, '정아','2022-03-01',22,'010-1822-1231'),
(1105, '아','2022-03-01',25,'010-1172-1231'),
(1106, '123','2022-03-01',21,'010-1562-1231'),
(1107, '김정1','2022-03-01',28,'010-1322-1231');

create table 부서 (
	부서번호 int primary key,
	부서명 varchar(10) not null default '인사부',
	부서장 int unique,
	사무실 varchar(4) not null unique,
	전화번호 varchar(13) unique
);

insert into 부서 values
(100,'기',1101,'A402','02-2333-1273'),
(101,'식',1102,'A405','02-2333-1263'),
(102,'획식',1103,'A406','02-2333-1213'),
(103,'기식',1104,'A407','02-2333-1223'),
(104,'기획',1105,'A408','02-2333-1243');

create table 근무하다(
	사번 int references 사원(사원번호),
	부서번호 int references 부서(부서번호),
	직책 varchar(10) not null
);

insert into 근무하다 values
(1101,100,'부장'),
(1102,101,'과장'),
(1102,101,'과장'),
(1103,102,'차장'),
(1103,102,'차장'),
(1101,100,'부장'),
(1101,100,'부장'),
(1102,101,'과장');

select * from 근무하다 where 직책 = '과장';
